load-tests/k6/reports/20260726-233614/progress-read-stdout.txt

          /\      |‾‾| /‾‾/   /‾‾/   
     /\  /  \     |  |/  /   /  /    
    /  \/    \    |     (   /   ‾‾\  
   /          \   |  |\  \ |  (‾)  | 
  / __________ \  |__| \__\ \_____/ .io

     execution: local
        script: C:\Users\omano\OneDrive - Puravankara Limited\Manoranjan\Antigravity Experiment\000 Project PM\SETU\load-tests\k6\scenarios\progress-read.js
        output: -

     scenarios: (100.00%) 1 scenario, 10 max VUs, 1m30s max duration (incl. graceful stop):
              * default: 10 looping VUs for 1m0s (gracefulStop: 30s)


running (0m01.0s), 10/10 VUs, 0 complete and 0 interrupted iterations
default   [   2% ] 10 VUs  0m01.0s/1m0s

running (0m02.0s), 10/10 VUs, 0 complete and 0 interrupted iterations
default   [   3% ] 10 VUs  0m02.0s/1m0s

running (0m03.0s), 10/10 VUs, 0 complete and 0 interrupted iterations
default   [   5% ] 10 VUs  0m03.0s/1m0s

running (0m04.0s), 10/10 VUs, 0 complete and 0 interrupted iterations
default   [   7% ] 10 VUs  0m04.0s/1m0s

running (0m05.0s), 10/10 VUs, 0 complete and 0 interrupted iterations
default   [   8% ] 10 VUs  0m05.0s/1m0s

running (0m06.0s), 10/10 VUs, 0 complete and 0 interrupted iterations
default   [  10% ] 10 VUs  0m06.0s/1m0s

running (0m07.0s), 10/10 VUs, 0 complete and 0 interrupted iterations
default   [  12% ] 10 VUs  0m07.0s/1m0s

running (0m08.0s), 10/10 VUs, 0 complete and 0 interrupted iterations
default   [  13% ] 10 VUs  0m08.0s/1m0s

running (0m09.0s), 10/10 VUs, 0 complete and 0 interrupted iterations
default   [  15% ] 10 VUs  0m09.0s/1m0s

running (0m10.0s), 10/10 VUs, 0 complete and 0 interrupted iterations
default   [  17% ] 10 VUs  0m10.0s/1m0s

running (0m11.0s), 10/10 VUs, 0 complete and 0 interrupted iterations
default   [  18% ] 10 VUs  0m11.0s/1m0s

running (0m12.0s), 10/10 VUs, 0 complete and 0 interrupted iterations
default   [  20% ] 10 VUs  0m12.0s/1m0s

running (0m13.0s), 10/10 VUs, 0 complete and 0 interrupted iterations
default   [  22% ] 10 VUs  0m13.0s/1m0s

running (0m14.0s), 10/10 VUs, 0 complete and 0 interrupted iterations
default   [  23% ] 10 VUs  0m14.0s/1m0s

running (0m15.0s), 10/10 VUs, 0 complete and 0 interrupted iterations
default   [  25% ] 10 VUs  0m15.0s/1m0s

running (0m16.0s), 10/10 VUs, 0 complete and 0 interrupted iterations
default   [  27% ] 10 VUs  0m16.0s/1m0s

running (0m17.0s), 10/10 VUs, 0 complete and 0 interrupted iterations
default   [  28% ] 10 VUs  0m17.0s/1m0s

running (0m18.0s), 10/10 VUs, 0 complete and 0 interrupted iterations
default   [  30% ] 10 VUs  0m18.0s/1m0s

running (0m19.0s), 10/10 VUs, 0 complete and 0 interrupted iterations
default   [  32% ] 10 VUs  0m19.0s/1m0s

running (0m20.0s), 10/10 VUs, 0 complete and 0 interrupted iterations
default   [  33% ] 10 VUs  0m20.0s/1m0s

running (0m21.0s), 10/10 VUs, 0 complete and 0 interrupted iterations
default   [  35% ] 10 VUs  0m21.0s/1m0s

running (0m22.0s), 10/10 VUs, 0 complete and 0 interrupted iterations
default   [  37% ] 10 VUs  0m22.0s/1m0s

running (0m23.0s), 10/10 VUs, 0 complete and 0 interrupted iterations
default   [  38% ] 10 VUs  0m23.0s/1m0s

running (0m24.0s), 10/10 VUs, 0 complete and 0 interrupted iterations
default   [  40% ] 10 VUs  0m24.0s/1m0s

running (0m25.0s), 10/10 VUs, 0 complete and 0 interrupted iterations
default   [  42% ] 10 VUs  0m25.0s/1m0s

running (0m26.0s), 10/10 VUs, 0 complete and 0 interrupted iterations
default   [  43% ] 10 VUs  0m26.0s/1m0s

running (0m27.0s), 10/10 VUs, 0 complete and 0 interrupted iterations
default   [  45% ] 10 VUs  0m27.0s/1m0s

running (0m28.0s), 10/10 VUs, 0 complete and 0 interrupted iterations
default   [  47% ] 10 VUs  0m28.0s/1m0s

running (0m29.0s), 10/10 VUs, 4 complete and 0 interrupted iterations
default   [  48% ] 10 VUs  0m29.0s/1m0s

running (0m30.0s), 10/10 VUs, 7 complete and 0 interrupted iterations
default   [  50% ] 10 VUs  0m30.0s/1m0s

running (0m31.0s), 10/10 VUs, 8 complete and 0 interrupted iterations
default   [  52% ] 10 VUs  0m31.0s/1m0s

running (0m32.0s), 10/10 VUs, 10 complete and 0 interrupted iterations
default   [  53% ] 10 VUs  0m32.0s/1m0s

running (0m33.0s), 10/10 VUs, 10 complete and 0 interrupted iterations
default   [  55% ] 10 VUs  0m33.0s/1m0s

running (0m34.0s), 10/10 VUs, 10 complete and 0 interrupted iterations
default   [  57% ] 10 VUs  0m34.0s/1m0s

running (0m35.0s), 10/10 VUs, 10 complete and 0 interrupted iterations
default   [  58% ] 10 VUs  0m35.0s/1m0s

running (0m36.0s), 10/10 VUs, 10 complete and 0 interrupted iterations
default   [  60% ] 10 VUs  0m36.0s/1m0s

running (0m37.0s), 10/10 VUs, 10 complete and 0 interrupted iterations
default   [  62% ] 10 VUs  0m37.0s/1m0s

running (0m38.0s), 10/10 VUs, 10 complete and 0 interrupted iterations
default   [  63% ] 10 VUs  0m38.0s/1m0s

running (0m39.0s), 10/10 VUs, 10 complete and 0 interrupted iterations
default   [  65% ] 10 VUs  0m39.0s/1m0s

running (0m40.0s), 10/10 VUs, 10 complete and 0 interrupted iterations
default   [  67% ] 10 VUs  0m40.0s/1m0s

running (0m41.0s), 10/10 VUs, 10 complete and 0 interrupted iterations
default   [  68% ] 10 VUs  0m41.0s/1m0s

running (0m42.0s), 10/10 VUs, 10 complete and 0 interrupted iterations
default   [  70% ] 10 VUs  0m42.0s/1m0s

running (0m43.0s), 10/10 VUs, 10 complete and 0 interrupted iterations
default   [  72% ] 10 VUs  0m43.0s/1m0s

running (0m44.0s), 10/10 VUs, 10 complete and 0 interrupted iterations
default   [  73% ] 10 VUs  0m44.0s/1m0s

running (0m45.0s), 10/10 VUs, 10 complete and 0 interrupted iterations
default   [  75% ] 10 VUs  0m45.0s/1m0s

running (0m46.0s), 10/10 VUs, 10 complete and 0 interrupted iterations
default   [  77% ] 10 VUs  0m46.0s/1m0s

running (0m47.0s), 10/10 VUs, 10 complete and 0 interrupted iterations
default   [  78% ] 10 VUs  0m47.0s/1m0s

running (0m48.0s), 10/10 VUs, 10 complete and 0 interrupted iterations
default   [  80% ] 10 VUs  0m48.0s/1m0s

running (0m49.0s), 10/10 VUs, 10 complete and 0 interrupted iterations
default   [  82% ] 10 VUs  0m49.0s/1m0s

running (0m50.0s), 10/10 VUs, 10 complete and 0 interrupted iterations
default   [  83% ] 10 VUs  0m50.0s/1m0s

running (0m51.0s), 10/10 VUs, 10 complete and 0 interrupted iterations
default   [  85% ] 10 VUs  0m51.0s/1m0s

running (0m52.0s), 10/10 VUs, 10 complete and 0 interrupted iterations
default   [  87% ] 10 VUs  0m52.0s/1m0s

running (0m53.0s), 10/10 VUs, 10 complete and 0 interrupted iterations
default   [  88% ] 10 VUs  0m53.0s/1m0s

running (0m54.0s), 10/10 VUs, 10 complete and 0 interrupted iterations
default   [  90% ] 10 VUs  0m54.0s/1m0s

running (0m55.0s), 10/10 VUs, 11 complete and 0 interrupted iterations
default   [  92% ] 10 VUs  0m55.0s/1m0s

running (0m56.0s), 10/10 VUs, 15 complete and 0 interrupted iterations
default   [  93% ] 10 VUs  0m56.0s/1m0s

running (0m57.0s), 10/10 VUs, 18 complete and 0 interrupted iterations
default   [  95% ] 10 VUs  0m57.0s/1m0s

running (0m58.0s), 10/10 VUs, 20 complete and 0 interrupted iterations
default   [  97% ] 10 VUs  0m58.0s/1m0s

running (0m59.0s), 10/10 VUs, 20 complete and 0 interrupted iterations
default   [  98% ] 10 VUs  0m59.0s/1m0s

running (1m00.0s), 10/10 VUs, 20 complete and 0 interrupted iterations
default   [ 100% ] 10 VUs  1m00.0s/1m0s

running (1m01.1s), 10/10 VUs, 20 complete and 0 interrupted iterations
default ↓ [ 100% ] 10 VUs  1m0s

running (1m02.0s), 10/10 VUs, 20 complete and 0 interrupted iterations
default ↓ [ 100% ] 10 VUs  1m0s

running (1m03.0s), 10/10 VUs, 20 complete and 0 interrupted iterations
default ↓ [ 100% ] 10 VUs  1m0s

running (1m04.0s), 10/10 VUs, 20 complete and 0 interrupted iterations
default ↓ [ 100% ] 10 VUs  1m0s

running (1m05.0s), 10/10 VUs, 20 complete and 0 interrupted iterations
default ↓ [ 100% ] 10 VUs  1m0s

running (1m06.0s), 10/10 VUs, 20 complete and 0 interrupted iterations
default ↓ [ 100% ] 10 VUs  1m0s

running (1m07.0s), 10/10 VUs, 20 complete and 0 interrupted iterations
default ↓ [ 100% ] 10 VUs  1m0s

running (1m08.2s), 10/10 VUs, 20 complete and 0 interrupted iterations
default ↓ [ 100% ] 10 VUs  1m0s

running (1m09.2s), 10/10 VUs, 20 complete and 0 interrupted iterations
default ↓ [ 100% ] 10 VUs  1m0s

running (1m10.0s), 10/10 VUs, 20 complete and 0 interrupted iterations
default ↓ [ 100% ] 10 VUs  1m0s

running (1m11.0s), 10/10 VUs, 20 complete and 0 interrupted iterations
default ↓ [ 100% ] 10 VUs  1m0s

running (1m12.0s), 10/10 VUs, 20 complete and 0 interrupted iterations
default ↓ [ 100% ] 10 VUs  1m0s

running (1m13.0s), 10/10 VUs, 20 complete and 0 interrupted iterations
default ↓ [ 100% ] 10 VUs  1m0s

running (1m14.0s), 10/10 VUs, 20 complete and 0 interrupted iterations
default ↓ [ 100% ] 10 VUs  1m0s

running (1m15.0s), 10/10 VUs, 20 complete and 0 interrupted iterations
default ↓ [ 100% ] 10 VUs  1m0s

running (1m16.0s), 10/10 VUs, 20 complete and 0 interrupted iterations
default ↓ [ 100% ] 10 VUs  1m0s

running (1m17.0s), 10/10 VUs, 20 complete and 0 interrupted iterations
default ↓ [ 100% ] 10 VUs  1m0s

running (1m18.0s), 10/10 VUs, 20 complete and 0 interrupted iterations
default ↓ [ 100% ] 10 VUs  1m0s

running (1m19.0s), 10/10 VUs, 20 complete and 0 interrupted iterations
default ↓ [ 100% ] 10 VUs  1m0s

running (1m20.0s), 10/10 VUs, 20 complete and 0 interrupted iterations
default ↓ [ 100% ] 10 VUs  1m0s

running (1m21.0s), 10/10 VUs, 20 complete and 0 interrupted iterations
default ↓ [ 100% ] 10 VUs  1m0s

running (1m22.0s), 10/10 VUs, 20 complete and 0 interrupted iterations
default ↓ [ 100% ] 10 VUs  1m0s

running (1m23.0s), 10/10 VUs, 20 complete and 0 interrupted iterations
default ↓ [ 100% ] 10 VUs  1m0s

running (1m24.0s), 10/10 VUs, 20 complete and 0 interrupted iterations
default ↓ [ 100% ] 10 VUs  1m0s

running (1m25.0s), 10/10 VUs, 20 complete and 0 interrupted iterations
default ↓ [ 100% ] 10 VUs  1m0s

running (1m26.0s), 10/10 VUs, 20 complete and 0 interrupted iterations
default ↓ [ 100% ] 10 VUs  1m0s

running (1m27.0s), 10/10 VUs, 20 complete and 0 interrupted iterations
default ↓ [ 100% ] 10 VUs  1m0s

running (1m28.0s), 10/10 VUs, 20 complete and 0 interrupted iterations
default ↓ [ 100% ] 10 VUs  1m0s

running (1m29.0s), 06/10 VUs, 24 complete and 0 interrupted iterations
default ↓ [ 100% ] 10 VUs  1m0s

running (1m30.0s), 04/10 VUs, 26 complete and 0 interrupted iterations
default ↓ [ 100% ] 10 VUs  1m0s

     ✓ login status is 2xx
     ✓ eps tree status is 2xx
     ✓ execution vendors status is 2xx
     ✓ execution has-micro status is 2xx
     ✓ execution breakdown status is 2xx

     checks.........................: 100.00% ✓ 150      ✗ 0   
     data_received..................: 1.2 MB  13 kB/s
     data_sent......................: 1.5 MB  17 kB/s
     http_req_blocked...............: avg=31.89ms  min=0s      med=0s     max=483.4ms p(90)=0s       p(95)=476.47ms
     http_req_connecting............: avg=666.09µs min=0s      med=0s     max=15.97ms p(90)=0s       p(95)=6.76ms  
   ✗ http_req_duration..............: avg=5.1s     min=34.04ms med=1.18s  max=26.86s  p(90)=22.15s   p(95)=24.93s  
       { expected_response:true }...: avg=5.1s     min=34.04ms med=1.18s  max=26.86s  p(90)=22.15s   p(95)=24.93s  
     http_req_failed................: 0.00%   ✓ 0        ✗ 150 
     http_req_receiving.............: avg=668.7µs  min=0s      med=227µs  max=24.12ms p(90)=991.65µs p(95)=1.58ms  
     http_req_sending...............: avg=834.55µs min=0s      med=526µs  max=13.41ms p(90)=1.75ms   p(95)=2.93ms  
     http_req_tls_handshaking.......: avg=0s       min=0s      med=0s     max=0s      p(90)=0s       p(95)=0s      
     http_req_waiting...............: avg=5.1s     min=34.04ms med=1.18s  max=26.86s  p(90)=22.15s   p(95)=24.92s  
     http_reqs......................: 150     1.666396/s
     iteration_duration.............: avg=29.26s   min=24.31s  med=28.46s max=35.42s  p(90)=32.75s   p(95)=34.34s  
     iterations.....................: 26      0.288842/s
     vus............................: 4       min=4      max=10
     vus_max........................: 10      min=10     max=10


running (1m30.0s), 00/10 VUs, 26 complete and 4 interrupted iterations
default ✓ [ 100% ] 10 VUs  1m0s
time="2026-07-26T23:39:54+05:30" level=error msg="thresholds on metrics 'http_req_duration' have been crossed"